# EqualityWitnessDisplay Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EqualityWitnessDisplay Property
ParameterTypeId Class See Also
---
"Equality Witness Display"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EqualityWitnessDisplay { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EqualityWitnessDisplay As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EqualityWitnessDisplay {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace